#+title: Model

* Load and prep Data
#+begin_src python :results table :session
import math
import tensorflow as tf
import pandas as pd
import numpy as np
# from tensorflow.keras import layers

sampled = ['Work Pressure', 'Sleep Duration', 'Depression', 'Financial Stress', 'Work/Study Hours', 'Academic Pressure']
data = pd.read_csv('data/student_depression_dataset.csv')[sampled]
data['Sleep Duration'] = data['Sleep Duration'].map({
    "'5-6 hours'": 2,
    "'Less than 5 hours'": 1,
    "'7-8 hours'": 3,
    "'More than 8 hours'": 4,
    'Others': 0
})
data = data[data['Financial Stress'] != '?']
data['Financial Stress'] = data["Financial Stress"].apply(float)
train_X = data[data['Sleep Duration'] > 0]
test_X = train_X.loc[train_X.sample(frac=0.2).index]
test_y = test_X.pop('Depression').to_numpy()
train_y = train_X.pop('Depression').to_numpy()
train_X.head()
#+end_src

#+RESULTS:
|   | Work Pressure | Sleep Duration | Financial Stress | Work/Study Hours | Academic Pressure |
|---+---------------+----------------+------------------+------------------+-------------------|
| 0 |           0.0 |            2.0 |              1.0 |              3.0 |               5.0 |
| 1 |           0.0 |            2.0 |              2.0 |              3.0 |               2.0 |
| 2 |           0.0 |            1.0 |              1.0 |              9.0 |               3.0 |
| 3 |           0.0 |            3.0 |              5.0 |              4.0 |               3.0 |
| 4 |           0.0 |            2.0 |              1.0 |              1.0 |               4.0 |

#+begin_src python :results table :session
train_X['Academic Pressure'].describe()
#+end_src

#+RESULTS:
| count |            27880.0 |
| mean  | 3.1413199426111906 |
| std   |  1.381720028037692 |
| min   |                0.0 |
| 25%   |                2.0 |
| 50%   |                3.0 |
| 75%   |                4.0 |
| max   |                5.0 |

* Train Model
#+begin_src python :session :results verbatim
layers = tf.keras.layers
train_X = train_X.to_numpy()
test_X = test_X.to_numpy()

in_shape = train_X.shape[1:]

normalize = layers.Normalization(input_shape=in_shape)
normalize.adapt(train_X)
model = tf.keras.Sequential([
    normalize,
    layers.Dense(64, activation='relu'),
    layers.Dense(64, activation='relu'),
    layers.Dense(1, activation='sigmoid')
])
#+end_src

#+RESULTS:
: None

#+begin_src python :results none :session
model.compile(loss = tf.keras.losses.BinaryCrossentropy(), optimizer = tf.keras.optimizers.Adam())
model.fit(train_X, train_y, epochs=10)
#+end_src

#+begin_src python :session :results value
probs = model.predict(test_X)
predictions = (probs >= 0.5).astype(int)
model.export('predictor_save_model')
(predictions.flatten() == test_y).sum() / test_y.shape[0]
#+end_src

#+RESULTS:
: 0.771700143472023

#+begin_src python :results table :session
test_X[np.argmin(probs)]
probs[np.argmin(probs)]
list(pd.read_csv('data/student_depression_dataset.csv').columns)
#+end_src

#+RESULTS:
| id | Gender | Age | City | Profession | Academic Pressure | Work Pressure | CGPA | Study Satisfaction | Job Satisfaction | Sleep Duration | Dietary Habits | Degree | Have you ever had suicidal thoughts ? | Work/Study Hours | Financial Stress | Family History of Mental Illness | Depression |

* Save model to js
#+begin_src bash :results verbatim
source $HOME/.zshrc
conda activate jstensor
tensorflowjs_converter --input_format=tf_saved_model predictor_save_model/ javaScriptModel/
#+end_src

#+RESULTS:
